[
  { "date": "1897", "fact": "Thaddeus Cahill patents the Telharmonium, the first fully electronic and polyphonic musical instrument, establishing early concepts of electronic sound generation and transmission." },
  { "date": "1920", "fact": "Léon Theremin invents the theremin, the first electronic instrument played without physical contact, influencing future synthesizer design and electronic performance techniques." },
  { "date": "1928", "fact": "Maurice Martenot introduces the Ondes Martenot, an early electronic instrument widely used in classical and experimental compositions for its expressive timbres." },
  { "date": "1948", "fact": "Pierre Schaeffer introduces musique concrète in Paris, using recorded sounds and tape manipulation as musical material, redefining the boundaries of composition and electronic music." },
  { "date": "1955", "fact": "Karlheinz Stockhausen begins producing electronic compositions in Germany, combining serialism and electronic sound generation, deeply influencing avant-garde and experimental music." },
  { "date": "1957", "fact": "The RCA Mark II Sound Synthesizer is installed at the Columbia-Princeton Electronic Music Center in New York, becoming the first programmable electronic synthesizer." },
  { "date": "1964", "fact": "Robert Moog commercializes the Moog modular synthesizer, making electronic sound synthesis accessible to musicians outside academic institutions." },
  { "date": "1968", "fact": "Wendy Carlos releases 'Switched-On Bach', a commercially successful album recorded entirely with Moog synthesizers, introducing electronic music to a mass audience." },
  { "date": "1970", "fact": "Kraftwerk is officially formed in Düsseldorf, pioneering minimalist electronic music and influencing techno, electro, and synth-pop." },
  { "date": "1972", "fact": "Brian Eno begins experimenting with tape loops and generative music concepts, becoming a key figure in the development of ambient music." },
  { "date": "1974", "fact": "Kraftwerk releases 'Autobahn', achieving international success and demonstrating that electronic music can reach mass audiences." },
  { "date": "1977", "fact": "Donna Summer releases 'I Feel Love', produced by Giorgio Moroder, featuring a fully synthesized rhythm that profoundly influences disco and techno." },
  { "date": "1978", "fact": "Yellow Magic Orchestra is formed in Tokyo, popularizing electronic pop and early sampling techniques worldwide." },
  { "date": "1979", "fact": "Gary Numan releases 'The Pleasure Principle', bringing synthesizers to the top of the UK charts and accelerating synth-pop." },
  { "date": "1980", "fact": "Roland releases the TR-808 drum machine, later becoming fundamental to hip hop, techno, and house music." },
  { "date": "1981", "fact": "Roland releases the TB-303 Bass Line, later defining the acid house sound." },
  { "date": "1982", "fact": "Frankie Knuckles becomes resident DJ at The Warehouse in Chicago, helping give birth to house music." },
  { "date": "1982", "fact": "Afrika Bambaataa releases 'Planet Rock', defining the electro genre by blending hip hop and electronic music." },
  { "date": "1983", "fact": "The MIDI standard is introduced, revolutionizing electronic music production and live performance." },
  { "date": "1983", "fact": "Herbie Hancock releases 'Rockit', bridging electronic music, funk, and hip hop culture." },
  { "date": "1984", "fact": "Detroit producers Juan Atkins, Derrick May, and Kevin Saunderson shape what becomes Detroit techno." },
  { "date": "1984", "fact": "Jesse Saunders releases 'On & On', widely regarded as the first house music record." },
  { "date": "1986", "fact": "House music spreads from Chicago to New York and Europe, becoming a dominant club sound." },
  { "date": "1987", "fact": "Phuture releases 'Acid Tracks', officially defining the acid house sound using the TB-303." },
  { "date": "1988", "fact": "The Second Summer of Love takes place in the UK, as acid house and rave culture explode." },
  { "date": "1988", "fact": "The compilation 'Techno! The New Dance Sound of Detroit' popularizes the term techno internationally." },
  { "date": "1989", "fact": "The fall of the Berlin Wall accelerates the rise of Berlin’s techno scene." },
  { "date": "1989", "fact": "Warp Records is founded, later becoming a defining label for IDM and experimental electronic music." },
  { "date": "1989", "fact": "The first Love Parade is held in Berlin, becoming a major symbol of techno culture." },
  { "date": "1990", "fact": "Rave culture expands rapidly across Europe through large-scale illegal parties and free festivals." },
  { "date": "1991", "fact": "Tresor club opens in Berlin, becoming one of the most influential techno clubs worldwide." },
  { "date": "1991", "fact": "Massive Attack releases 'Blue Lines', establishing the foundations of trip-hop." },
  { "date": "1992", "fact": "Warp Records releases the 'Artificial Intelligence' compilation, helping define IDM." },
  { "date": "1992", "fact": "Aphex Twin releases 'Selected Ambient Works 85–92', shaping the future of IDM." },
  { "date": "1993", "fact": "Jungle music emerges in the UK, later evolving into drum and bass." },
  { "date": "1994", "fact": "The UK Criminal Justice Act targets unlicensed raves, marking a turning point in rave culture." },
  { "date": "1995", "fact": "Drum and bass becomes a clearly defined genre in the UK." },
  { "date": "1996", "fact": "Goa trance gains international recognition." },
  { "date": "1997", "fact": "Daft Punk releases 'Homework', popularizing French house globally." },
  { "date": "1997", "fact": "Aphex Twin releases 'Come to Daddy', pushing experimental electronic music into the mainstream." },
  { "date": "1998", "fact": "Minimal techno gains popularity in Europe." },
  { "date": "1999", "fact": "The first Ultra Music Festival takes place in Miami." },
  { "date": "1999", "fact": "Napster launches, transforming digital music distribution." },
  { "date": "2000", "fact": "The Detroit Electronic Music Festival debuts." },
  { "date": "2001", "fact": "Ableton Live is released, transforming electronic music production and live performance." },
  { "date": "2001", "fact": "Daft Punk releases 'Discovery', blending house, disco, and pop aesthetics." },
  { "date": "2002", "fact": "Dubstep begins to emerge in South London." },
  { "date": "2003", "fact": "Online forums and digital labels accelerate the globalization of electronic music." },
  { "date": "2004", "fact": "Electroclash peaks as a genre." },
  { "date": "2005", "fact": "Tomorrowland festival debuts in Belgium." },
  { "date": "2006", "fact": "Berlin solidifies its status as a global techno capital." },
  { "date": "2007", "fact": "Justice releases '†' (Cross), defining the bloghouse era." },
  { "date": "2008", "fact": "Spotify launches, reshaping music discovery and monetization." },
  { "date": "2009", "fact": "Laptop-based bedroom production becomes widespread." },
  { "date": "2012", "fact": "Global bass music scenes diversify." },
  { "date": "2013", "fact": "Daft Punk’s 'Random Access Memories' wins multiple Grammy Awards." },
  { "date": "2014", "fact": "Hardware synthesizers and drum machines experience a revival." },
  { "date": "2016", "fact": "Modular synthesizers experience a global resurgence." },
  { "date": "2018", "fact": "Artificial intelligence begins influencing experimental electronic music." },
  { "date": "2020", "fact": "The COVID-19 pandemic forces clubs and festivals to close, accelerating livestreamed electronic events." },
  { "date": "2022", "fact": "Hybrid live sets combining modular synths, visuals, and real-time performance become common at festivals." }
]
